{
  "categories": [
    {
      "id": 1,
      "title": "Imagen",
      "description": "Herramientas para generación o edición de imágenes mediante IA",
      "details": "Permiten crear, editar o mejorar imágenes a partir de texto o patrones visuales.",
      "imageName": "imagen",
      "products": [
        {
          "name": "DALL·E",
          "developer": "Desarrollado por Open AI",
          "details": "DALL·E es un modelo de inteligencia artificial capaz de generar imágenes realistas a partir de descripciones textuales. Utiliza técnicas de aprendizaje profundo para componer objetos, escenas y estilos artísticos. Es ideal para la creación creativa y la generación visual automatizada.",
          "imageName": "logo_dalle"
        },
        {
          "name": "Midjourney",
          "developer": "Desarrollado por Midjourney Inc.",
          "details": "Midjourney es una herramienta basada en IA que transforma texto en arte visual de alta calidad. Destaca por su estilo artístico distintivo y su enfoque comunitario en Discord. Es ampliamente utilizada en diseño conceptual y creación artística experimental.",
          "imageName": "logo_midjourney"
        },
        {
          "name": "Stable Diffusion",
          "developer": "Desarrollado por Stability AI",
          "details": "Stable Diffusion es un modelo de generación de imágenes open-source que permite crear arte a partir de texto. Puede ejecutarse localmente, lo que ofrece mayor control y privacidad. Su flexibilidad lo hace ideal para desarrolladores y artistas digitales.",
          "imageName": "logo_stablediffusion"},
        {
          "name": "Runway ML",
          "developer": "Desarrollado por Runway",
          "details": "Runway ML proporciona una interfaz accesible para usar modelos de IA sin escribir código. Su enfoque visual permite editar, generar y transformar imágenes y vídeos fácilmente. Es popular entre creadores de contenido, diseñadores y cineastas.",
          "imageName": "logo_runwayml"
        },
        {
          "name": "Adobe Firefly",
          "developer": "Desarrollado por Adobe",
          "details": "Adobe Firefly es una familia de modelos de IA generativa integrada en las herramientas creativas de Adobe. Permite generar imágenes, efectos y texto estilizado a partir de indicaciones escritas. Está diseñada para integrarse de forma ética y práctica en flujos creativos profesionales.",
          "imageName": "logo_firefly"
        }
      ]
    },
    {
      "id": 2,
      "title": "Texto",
      "description": "Herramientas centradas en el procesamiento de lenguaje natural",
      "details": "Generación de texto, corrección gramatical, reescritura y asistencia en redacción.",
      "imageName": "texto",
      "products": [
        {
          "name": "ChatGPT",
          "developer": "Desarrollado por OpenAI",
          "details": "ChatGPT es un modelo conversacional de lenguaje natural que permite mantener diálogos coherentes y útiles. Es capaz de responder preguntas, redactar textos, corregir estilo y traducir idiomas. Es ampliamente utilizado en educación, atención al cliente y creación de contenido.",
          "imageName": "logo_dalle"
        },
        {
          "name": "Jasper AI",
          "developer": "Desarrollado por Jasper",
          "details": "Jasper AI es una plataforma enfocada en la redacción de textos de marketing y contenidos creativos. Utiliza inteligencia artificial para generar artículos, anuncios y correos efectivos. Es muy popular entre equipos de contenido y freelancers.",
          "imageName": "logo_jasper"
        },
        {
          "name": "QuillBot",
          "developer": "Desarrollado por QuillBot",
          "details": "QuillBot es una herramienta de reescritura y paráfrasis de texto basada en IA. Ayuda a mejorar redacción, resumir documentos y encontrar sinónimos automáticamente. Es muy útil para estudiantes, escritores y traductores.",
          "imageName": "logo_quillbot"
        },
        {
          "name": "Sudowrite",
          "developer": "Desarrollado por Sudowrite",
          "details": "Sudowrite es un asistente de escritura creativa impulsado por IA, diseñado para novelistas y escritores de ficción. Sugiere ideas, continúa textos y genera descripciones. Facilita superar bloqueos creativos y enriquecer narrativas.",
          "imageName": "logo_sudowrite"
        }
      ]
    },
    {
      "id": 3,
      "title": "Audio",
      "description": "Herramientas para síntesis, edición y análisis de audio mediante IA",
      "details": "Conversión de texto a voz, análisis de audio, edición inteligente.",
      "imageName": "audio",
      "products": [
        {
          "name": "Whisper",
          "developer": "Desarrollado por OpenAI",
          "details": "Whisper es un sistema de reconocimiento automático de voz que transcribe audio con alta precisión. Soporta múltiples idiomas y es útil en subtitulado, transcripción y accesibilidad. Su código abierto lo hace accesible para desarrolladores y proyectos de investigación.",
          "imageName": "logo_dalle"
        },
        {
          "name": "Descript",
          "developer": "Desarrollado por Descript Inc.",
          "details": "Descript combina edición de audio, video y transcripción mediante inteligencia artificial. Permite editar grabaciones como si fueran documentos de texto. Es ideal para podcasters, creadores de contenido y periodistas digitales.",
          "imageName": "logo_descript"
        },
        {
          "name": "AssemblyAI",
          "developer": "Desarrollado por AssemblyAI",
          "details": "AssemblyAI ofrece una potente API de transcripción y análisis de audio basada en IA. Detecta temas, palabras clave, emociones y más. Es utilizada por desarrolladores para construir soluciones avanzadas de voz a texto.",
          "imageName": "logo_assemblyai"
        },
        {
          "name": "Sonix",
          "developer": "Desarrollado por Sonix Inc.",
          "details": "Sonix proporciona servicios automáticos de transcripción, traducción y subtitulado. Su precisión y velocidad lo hacen ideal para equipos profesionales. Incluye herramientas colaborativas para revisar y compartir audios.",
          "imageName": "logo_sonix"
        },
        {
          "name": "Voicemod",
          "developer": "Desarrollado por Voicemod",
          "details": "Voicemod es una herramienta de modificación de voz en tiempo real potenciada por IA. Permite cambiar la voz durante videollamadas, juegos y transmisiones. Es popular entre gamers, streamers y creadores de contenido.",
          "imageName": "logo_voicemod"
        }

      ]
    },
    {
      "id": 4,
      "title": "Investigación",
      "description": "Asistentes inteligentes para el análisis y búsqueda académica",
      "details": "Ayudan a encontrar, resumir y organizar información científica.",
      "imageName": "invest",
      "products": [
        {
          "name": "Elicit",
          "developer": "Desarrollado por Ought",
          "details": "Elicit es una IA diseñada para asistir en la revisión de literatura científica. Automatiza la búsqueda, comparación y síntesis de artículos académicos. Ayuda a los investigadores a encontrar respuestas precisas de manera más eficiente.",
          "imageName": "logo_elicit"
        },
        {
          "name": "Consensus",
          "developer": "Desarrollado por Consensus",
          "details": "Consensus utiliza inteligencia artificial para responder preguntas científicas basadas en artículos revisados por pares. Resume conclusiones y evidencia relevante en segundos. Es una herramienta clave para estudiantes y científicos.",
          "imageName": "logo_consensus"
        },
        {
          "name": "Scite",
          "developer": "Desarrollado por Scite Inc.",
          "details": "Scite es una plataforma de investigación que analiza cómo se citan los estudios científicos. Clasifica las citas como de soporte, contraste o mención. Ayuda a evaluar la credibilidad y el impacto de los artículos en la comunidad académica.",
          "imageName": "logo_scite"
        }
      ]
    },
    {
      "id": 5,
      "title": "Programación",
      "description": "Asistentes de desarrollo y generación de código por IA",
      "details": "Sugieren código, completan funciones y ayudan en la depuración.",
      "imageName": "programacion",
      "products": [
        {
          "name": "GitHub Copilot",
          "developer": "Desarrollado por GitHub y OpenAI",
          "details": "GitHub Copilot es un asistente de codificación que sugiere líneas completas de código en tiempo real. Aprende del contexto y el estilo del desarrollador para generar soluciones útiles. Es compatible con múltiples lenguajes y editores como VS Code.",
          "imageName": "logo_copilot"
        },
        {
          "name": "Amazon CodeWhisperer",
          "developer": "Desarrollado por Amazon",
          "details": "CodeWhisperer es un asistente de programación impulsado por IA que genera fragmentos de código automáticamente. Se integra con entornos de desarrollo como AWS Cloud9 y JetBrains. Ayuda a mejorar la productividad y reducir errores.",
          "imageName": "logo_codewhisperer"
        },
        {
          "name": "Tabnine",
          "developer": "Desarrollado por Tabnine",
          "details": "Tabnine es una herramienta de autocompletado de código basada en modelos de lenguaje. Funciona localmente o en la nube y es compatible con los principales IDEs. Aprende de tu base de código y prioriza la privacidad del usuario.",
          "imageName": "logo_tabnine"
        },
        {
          "name": "CodeT5",
          "developer": "Desarrollado por Salesforce Research",
          "details": "CodeT5 es un modelo de lenguaje adaptado a tareas de programación como generación de código, traducción y corrección. Está entrenado sobre múltiples lenguajes y repositorios. Se utiliza en investigación y herramientas de desarrollo avanzadas.",
          "imageName": "logo_codet5"
        },
        {
          "name": "PolyCoder",
          "developer": "Desarrollado por Carnegie Mellon University",
          "details": "PolyCoder es un modelo de código abierto optimizado para escribir en C. Fue creado como alternativa ligera a modelos más pesados como Codex. Es ideal para entornos académicos y experimentales que requieran eficiencia.",
          "imageName": "logo_polycoder"
        }

      ]
    }
  ],

  "Users": [
    {
      "firstName": "Daniela",
      "lastName": "Herrera",
      "email": "daniela@example.com",
      "password": "daniela1234"
    },
    {
      "firstName": "Andrea",
      "lastName": "gonzalez",
      "email": "andrea.gonzalez@example.com",
      "password": "andrea5678"
    },
    {
      "firstName": "Carlos",
      "lastName": "Moreno",
      "email": "carlos.moreno@example.com",
      "password": "carlos1234"
    },
    {
      "firstName": "Emanuel",
      "lastName": "Garcia",
      "email": "emanuel.garcia@example.com",
      "password": "emanuel1234"
    },
    {
      "firstName": "Lucía",
      "lastName": "Perez",
      "email": "lucia@example.com",
      "password": "lucia1234"
    }
  ]
}


